// তোমার কাছে বর্তমানে একটা নির্দিষ্ট বাজেট রয়েছে ফ্যামিলি ট্যুর দেয়ার জন্য। যেটা budget নামক একটা ভেরিএবলে থাকবে। নিচের প্রবলেম গুলো পড় এবং তোমার সিদ্ধান্ত নাও ।

// যদি তোমার বাজেট ৫০০০ এর বেশি হয় তাহলে তুমি ফ্যামিলি কে নিয়ে ট্যুর দিবে । অন্যথায় ৫০০০ এর কম হয় তাহলে ট্যুর না দিয়ে ঘুম দিবে। যদি তুমি ট্যুর দিতে পারো তার মানে তোমার কাছে ৫০০০ এর বেশি টাকা আছে। এখন ধরো হোটেল ভাড়া ৪০০০। তাহলে তুমি হিসেবে করো তাহলে হাতে আর কত টাকা এক্সট্রা আছে। যদি ২০০০এর বেশি টাকা হাতে থাকে তাহলে তুমি বারবিকিউ পার্টি করবে , না হলে ট্যুরে গিয়ে অল্প শপিং করবে।



var budget=80000;
if(budget>50000){

   

    console.log("Will go to a Tour");

    var hotelBill=4000;
    var remainingBill=budget-hotelBill;
    if(remainingBill>2000){
        console.log("Yahoo!! Burbeque Party");
    }
    else{
        console.log("Shopping !!");
    }
}
else{
    console.log("Will stay a home");
}